## n = int(input('Введите трехзначное число: '))
## sum = n // 100 + n % 10 + (n%100//10)
## print (sum)

## s = int(input('Введите количество журавликов: '))
## p = s // 6
## k = 2*s // 3
## print(f'Петя сделал {p}журавликов, Катя сделала {k} журавликов, Сережа сделал {p} журавликов')

## n = int(input('Введите номер билета: '))
## if (n // 100000 + n % 100000 // 10000 + n % 10000 // 1000) == (n % 1000 // 100 + n % 100 // 10 + n % 10):
##     print('yes')
## else:
##     print('no')

n = int(input('Введите 1 размер шоколадки: '))
m = int(input('Введите 2 размер шоколадки: '))
k = int(input('Введите количество долек: '))
if k >= n or k >= m and k <= n*m:
    print('yes')
else:
    print('no')